IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_INPUTXBAR_CONTROLSS_INPUTXBAR.xml
<module name="CONTROLSS_INPUTXBAR_CONTROLSS_INPUTXBAR" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_INPUTXBAR_PID" acronym="CONTROLSS_INPUTXBAR_PID" offset="0x0" width="32" description="">
		<bitfield id="PID_MSB16" width="16" begin="31" end="16" resetval="0x24960" description="Not Defined" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="PID_MISC" width="5" begin="15" end="11" resetval="0x0" description="Not Defined" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="PID_MAJOR" width="3" begin="10" end="8" resetval="0x2" description="Not Defined" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="PID_CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Not Defined" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="PID_MINOR" width="6" begin="5" end="0" resetval="0x20" description="Not Defined" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR0_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR0_GSEL" offset="0x100" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR0_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR0_G0" offset="0x104" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR0_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR0_G1" offset="0x108" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR1_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR1_GSEL" offset="0x140" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR1_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR1_G0" offset="0x144" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR1_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR1_G1" offset="0x148" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR2_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR2_GSEL" offset="0x180" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR2_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR2_G0" offset="0x184" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR2_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR2_G1" offset="0x188" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR3_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR3_GSEL" offset="0x1C0" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR3_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR3_G0" offset="0x1C4" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR3_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR3_G1" offset="0x1C8" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR4_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR4_GSEL" offset="0x200" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR4_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR4_G0" offset="0x204" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR4_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR4_G1" offset="0x208" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR5_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR5_GSEL" offset="0x240" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR5_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR5_G0" offset="0x244" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR5_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR5_G1" offset="0x248" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR6_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR6_GSEL" offset="0x280" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR6_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR6_G0" offset="0x284" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
