IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_INPUTXBAR_CONTROLSS_INPUTXBAR.xml
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR6_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR6_G1" offset="0x288" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR7_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR7_GSEL" offset="0x2C0" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR7_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR7_G0" offset="0x2C4" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR7_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR7_G1" offset="0x2C8" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR8_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR8_GSEL" offset="0x300" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR8_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR8_G0" offset="0x304" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR8_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR8_G1" offset="0x308" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR9_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR9_GSEL" offset="0x340" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR9_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR9_G0" offset="0x344" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR9_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR9_G1" offset="0x348" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR10_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR10_GSEL" offset="0x380" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR10_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR10_G0" offset="0x384" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR10_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR10_G1" offset="0x388" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR11_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR11_GSEL" offset="0x3C0" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR11_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR11_G0" offset="0x3C4" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR11_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR11_G1" offset="0x3C8" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR12_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR12_GSEL" offset="0x400" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR12_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR12_G0" offset="0x404" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR12_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR12_G1" offset="0x408" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR13_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR13_GSEL" offset="0x440" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR13_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR13_G0" offset="0x444" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR13_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR13_G1" offset="0x448" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
