IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_INPUTXBAR_CONTROLSS_INPUTXBAR.xml
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR14_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR14_GSEL" offset="0x480" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR14_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR14_G0" offset="0x484" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR14_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR14_G1" offset="0x488" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR15_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR15_GSEL" offset="0x4C0" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR15_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR15_G0" offset="0x4C4" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR15_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR15_G1" offset="0x4C8" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR16_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR16_GSEL" offset="0x500" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR16_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR16_G0" offset="0x504" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR16_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR16_G1" offset="0x508" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR17_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR17_GSEL" offset="0x540" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR17_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR17_G0" offset="0x544" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR17_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR17_G1" offset="0x548" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR18_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR18_GSEL" offset="0x580" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR18_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR18_G0" offset="0x584" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR18_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR18_G1" offset="0x588" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR19_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR19_GSEL" offset="0x5C0" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR19_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR19_G0" offset="0x5C4" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR19_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR19_G1" offset="0x5C8" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR20_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR20_GSEL" offset="0x600" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
