IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_INPUTXBAR_CONTROLSS_INPUTXBAR.xml
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR20_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR20_G0" offset="0x604" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR20_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR20_G1" offset="0x608" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR21_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR21_GSEL" offset="0x640" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR21_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR21_G0" offset="0x644" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR21_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR21_G1" offset="0x648" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR22_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR22_GSEL" offset="0x680" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR22_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR22_G0" offset="0x684" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR22_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR22_G1" offset="0x688" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR23_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR23_GSEL" offset="0x6C0" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR23_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR23_G0" offset="0x6C4" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR23_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR23_G1" offset="0x6C8" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR24_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR24_GSEL" offset="0x700" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR24_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR24_G0" offset="0x704" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR24_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR24_G1" offset="0x708" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR25_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR25_GSEL" offset="0x740" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR25_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR25_G0" offset="0x744" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR25_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR25_G1" offset="0x748" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR26_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR26_GSEL" offset="0x780" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR26_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR26_G0" offset="0x784" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
