IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_INPUTXBAR_CONTROLSS_INPUTXBAR.xml
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR26_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR26_G1" offset="0x788" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR27_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR27_GSEL" offset="0x7C0" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR27_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR27_G0" offset="0x7C4" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR27_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR27_G1" offset="0x7C8" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR28_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR28_GSEL" offset="0x800" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR28_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR28_G0" offset="0x804" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR28_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR28_G1" offset="0x808" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR29_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR29_GSEL" offset="0x840" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR29_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR29_G0" offset="0x844" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR29_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR29_G1" offset="0x848" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR30_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR30_GSEL" offset="0x880" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR30_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR30_G0" offset="0x884" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR30_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR30_G1" offset="0x888" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR31_GSEL" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR31_GSEL" offset="0x8C0" width="0" description="">
		<bitfield id="GSEL" width="1" begin="0" end="0" resetval="0x0" description="Select input source Group:0      G0 selected1      G1 selected" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR31_G0" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR31_G0" offset="0x8C4" width="8" description="">
		<bitfield id="SEL" width="8" begin="7" end="0" resetval="0x0" description="Select input source:0      G0.0 selected..x     G0.x selected" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INPUTXBAR_INPUTXBAR31_G1" acronym="CONTROLSS_INPUTXBAR_INPUTXBAR31_G1" offset="0x8C8" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="Select input source:0      G1.0 selected..31    G1.31 selected" range="4 - 0" rwaccess="RW"/>
	</register>
</module>